--- crates/rr-core/src/identity.rs
+++ replace Identity::from_seed_phrase -> Result<Self, nip06::Error> with Ok(Default::default())
@@ -29,19 +29,17 @@
 
     pub fn from_secret_key(secret_key: &SecretKey) -> Self {
         Self {
             keys: Keys::new(secret_key.clone()),
         }
     }
 
     pub fn from_seed_phrase(mnemonic_str: &str, passphrase: &str) -> Result<Self, nip06::Error> {
-        let _mnemonic = Mnemonic::from_str(mnemonic_str).map_err(nip06::Error::BIP39)?;
-        let keys = Keys::from_mnemonic(mnemonic_str, Some(passphrase))?;
-        Ok(Self { keys })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn from_nsec(nsec: &str) -> Result<Self, Box<dyn std::error::Error>> {
         let secret_key = SecretKey::from_bech32(nsec)?;
         Ok(Self {
             keys: Keys::new(secret_key),
         })
     }
