--- crates/rr-core/src/identity.rs
+++ replace Identity::generate_seed_phrase -> Result<String, Box<dyn std::error::Error>> with Ok(String::new())
@@ -42,18 +42,17 @@
     pub fn from_nsec(nsec: &str) -> Result<Self, Box<dyn std::error::Error>> {
         let secret_key = SecretKey::from_bech32(nsec)?;
         Ok(Self {
             keys: Keys::new(secret_key),
         })
     }
 
     pub fn generate_seed_phrase() -> Result<String, Box<dyn std::error::Error>> {
-        let mnemonic = Mnemonic::generate(12)?;
-        Ok(mnemonic.to_string())
+        Ok(String::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn keys(&self) -> &Keys {
         &self.keys
     }
 
     pub fn public_key(&self) -> PublicKey {
         self.keys.public_key()
