--- crates/rr-core/src/identity.rs
+++ replace IdentityManager::default_data_dir -> PathBuf with Default::default()
@@ -88,20 +88,17 @@
 impl IdentityManager {
     pub fn new(data_dir: impl Into<PathBuf>) -> Self {
         Self {
             data_dir: data_dir.into(),
         }
     }
 
     pub fn default_data_dir() -> PathBuf {
-        let home = std::env::var("HOME")
-            .or_else(|_| std::env::var("USERPROFILE"))
-            .unwrap_or_else(|_| ".".to_string());
-        PathBuf::from(home).join(".rr")
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn load_or_create(&self) -> Result<Identity, Box<dyn std::error::Error>> {
         let key_path = self.data_dir.join("keys.json");
         if key_path.exists() {
             self.load()
         } else {
             let identity = Identity::new();
